REDE 03:

VLAN DADOS: 31
Rede: 192.168.31.0
Mask: 255.255.255.0
Gateway: 192.168.31.1
Broadcast: 192.168.31.255
Broadcast Voz: 192.168.32.255
DHCP: 192.168.31.1 - Roteador

VLAN VOICE: 32
Rede: 192.168.32.0
Mask: 255.255.255.0
Gateway: 192.168.32.1
DHCP: 192.168.31.1

Switch Rede 03:

Switch> en
Switch# conf t
    > Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)# vlan 32
Switch(config-vlan)# name voice
Switch(config-vlan)# exit
Switch(config)# vlan 31
Switch(config-vlan)# name dados
Switch(config-vlan)# exit
Switch(config)# int fa 0/1
Switch(config-if)# switchport mode trunk
Switch(config-if-range)# exit
Switch(config)# int range fa 0/2-24
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 31
Switch(config-if-range)# exit
Switch(config)# int range fa 0/23-24
Switch(config-if-range)# switchport voice vlan 32
Switch(config-if-range)# exit
Switch(config)# end
Switch#
    > %SYS-5-CONFIG_I: Configured from console by console
    > Building configuration...
    > [OK]

Router Rede 03:

INTERFACES:

Router> en
Router# conf t
    > Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)# int fa 0/0
Router(config-if)# no shutdown
    > %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
Router(config-if)# exit
Router(config)# int fa 0/1
Router(config-if)# no shutdown
    > %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
Router(config-if)# ip address 11.0.0.2 255.0.0.0
Router(config-if)# exit
Router(config)# int fa 1/0
Router(config-if)# no shutdown
    > %LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up
Router(config-if)# ip address 12.0.0.2 255.0.0.0
Router(config-if)# exit
Router(config)# int fastEthernet 0/0.31
    > %LINK-5-CHANGED: Interface FastEthernet0/0.31, changed state to up
Router(config-subif)# ip add
Router(config-subif)# encapsulation dot1Q 31
Router(config-subif)# ip address 192.168.31.1 255.255.255.0
Router(config-subif)# exit
Router(config)# int fastEthernet 0/0.12
    > %LINK-5-CHANGED: Interface FastEthernet0/0.32, changed state to up
Router(config-subif)# encapsulation dot1Q 32
Router(config-subif)# ip address 192.168.32.1 255.255.255.0
Router(config-subif)# exit

DHCP:
Router(config)# ip dhcp pool dados
Router(dhcp-config)# network 192.168.31.0 255.255.255.0
Router(dhcp-config)# dns-server 192.168.11.3
Router(dhcp-config)# default-router 192.168.31.1
Router(dhcp-config)# exit
Router(config)# ip dhcp pool voice
Router(dhcp-config)# network 192.168.32.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.32.1
Router(dhcp-config)# option 150 ip 192.168.32.1
Router(dhcp-config)# exit
Router(config)# exit
Router(config)# exit
Router#
    > %SYS-5-CONFIG_I: Configured from console by console
    > Building configuration...
    > [OK]

TELEFONIA:
Router(config)# telephony-service
Router(config-telephony)# max-dn 10
Router(config-telephony)# max-ephones 10
Router(config-telephony)# ip source-address 192.168.32.1 port 2000
Router(config-telephony)# auto assign 1 to 10
Router(config-telephony)# exit
Router(config)# ephone-dn 1
Router(config-ephone-dn)# %LINK-3-UPDOWN: Interface ephone_dsp DN 1.1, changed state to up
Router(config-ephone-dn)# number 300
Router(config-ephone-dn)# exit
Router(config)# ephone-dn 2
Router(config-ephone-dn)# %LINK-3-UPDOWN: Interface ephone_dsp DN 2.1, changed state to up
Router(config-ephone-dn)# number 301
Router(config-ephone-dn)# exit
Router(config)# exit

ROTAS:
Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#network 192.168.31.0
Router(config-router)#network 192.168.32.0
Router(config-router)#network 11.0.0.0
Router(config-router)#network 12.0.0.0
Router(config-router)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console
w
Building configuration...
[OK]
Router#

ROTAS VOIP:

Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#dial-peer voice 1 voip
Router(config-dial-peer)#destination-pattern 100
Router(config-dial-peer)#session target ipv4:11.0.0.1
Router(config-dial-peer)#exit
Router(config)#dial-peer voice 2 voip
Router(config-dial-peer)#destination-pattern 101
Router(config-dial-peer)#session target ipv4:11.0.0.1
Router(config-dial-peer)#exit
Router(config)#dial-peer voice 3 voip
Router(config-dial-peer)#destination-pattern 200
Router(config-dial-peer)#session target ipv4:12.0.0.1
Router(config-dial-peer)#exit
Router(config)#dial-peer voice 4 voip
Router(config-dial-peer)#destination-pattern 201
Router(config-dial-peer)#session target ipv4:12.0.0.1
Router(config-dial-peer)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console
w
Building configuration...
[OK]
Router#