REDE 02:

VLAN DADOS: 21
Rede: 192.168.21.0
Mask: 255.255.255.0
Gateway: 192.168.21.1
Broadcast: 192.168.21.255
Broadcast Voz: 192.168.22.255

Range DHCP: 192.168.21.5 - 192.168.21.254
Range DHCP Voz: 192.168.22.5 - 192.168.22.254
Servidor DHCP: 192.168.11.2 - Rede 01

VLAN VOICE: 22
Rede: 192.168.22.0
Mask: 255.255.255.0
Gateway: 192.168.22.1
DHCP: 192.168.21.2

Switch Rede 02:

Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 21
Switch(config-vlan)#name dados
Switch(config-vlan)#exit
Switch(config)#vlan 22
Switch(config-vlan)#name voice
Switch(config-vlan)#exit
Switch(config)#int fa 0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#int range fa 0/2-24
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 21
Switch(config-if-range)#exit
Switch(config)#int range fa 0/23-24
Switch(config-if-range)#switchport voice vlan 22
Switch(config-if-range)#exit
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console
w
Building configuration...
[OK]


Router Rede 02:

INTERFACES:

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa 0/0
Router(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#int fa 0/1
Router(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
Router(config-if)#ip address 10.0.0.2 255.0.0.0
Router(config-if)#exit
Router(config)#int fa 1/0
Router(config-if)#no shutdown
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up
Router(config-if)#ip address 12.0.0.1 255.0.0.0
Router(config-if)#exit
Router(config)#int fastEthernet 0/0.21
%LINK-5-CHANGED: Interface FastEthernet0/0.21, changed state to up
Router(config-subif)#ip add
Router(config-subif)#encapsulation dot1Q 21
Router(config-subif)#ip address 192.168.21.1 255.255.255.0
Router(config-subif)#ip helper-address 192.168.11.2
Router(config-subif)#exit
Router(config)#int fastEthernet 0/0.22
%LINK-5-CHANGED: Interface FastEthernet0/0.22, changed state to up
Router(config-subif)#encapsulation dot1Q 22
Router(config-subif)#ip address 192.168.22.1 255.255.255.0
Router(config-subif)#ip helper-address 192.168.11.2
Router(config-subif)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console
Building configuration...
[OK]

TELEFONIA:

Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#telephony-service
Router(config-telephony)#max-dn 10
Router(config-telephony)#max-ephones 10
Router(config-telephony)#ip source-address 192.168.22.1 port 2000
Router(config-telephony)#auto assign 1 to 10
Router(config-telephony)#exit
Router(config)#ephone-dn 1
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 1.1, changed state to up
Router(config-ephone-dn)#number 200
Router(config-ephone-dn)#exit
Router(config)#ephone-dn 2
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 2.1, changed state to up
Router(config-ephone-dn)#number 201
%IPPHONE-6-REGISTER: ephone-1 IP:192.168.22.6 Socket:2 DeviceType:Phone has registered.
%IPPHONE-6-REGISTER: ephone-2 IP:192.168.22.8 Socket:2 DeviceType:Phone has registered.
Router(config-ephone-dn)#exit
Router(config)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console
Router#
Building configuration...
[OK]
Router#


ROTAS:


Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#network 192.168.21.0
Router(config-router)#network 192.168.22.0
Router(config-router)#network 10.0.0.0
Router(config-router)#network 12.0.0.0
Router(config-router)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console
w
Building configuration...
[OK]
Router#


ROTAS VOIP:

Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#dial-peer voice 1 voip
Router(config-dial-peer)#destination-pattern 300
Router(config-dial-peer)#session target ipv4:12.0.0.2
Router(config-dial-peer)#exit
Router(config)#dial-peer voice 2 voip
Router(config-dial-peer)#destination-pattern 301
Router(config-dial-peer)#session target ipv4:12.0.0.2
Router(config-dial-peer)#exit
Router(config)#dial-peer voice 3 voip
Router(config-dial-peer)#destination-pattern 100
Router(config-dial-peer)#session target ipv4:10.0.0.1
Router(config-dial-peer)#exit
Router(config)#dial-peer voice 4 voip
Router(config-dial-peer)#destination-pattern 101
Router(config-dial-peer)#session target ipv4:10.0.0.1
Router(config-dial-peer)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console
w
Building configuration...
[OK]
Router#